{
  "title": "How to install Windows 11",
  "description": "Windows 11 is the latest major release of Microsoft's Windows NT operating system, released in October 2021. It is a free upgrade to its predecessor, Windows 10 (2015), available for any Windows 10 devices that meet the new Windows 11 system requirements. Windows 11 features major changes to the Windows shell influenced by the canceled Windows 10X, including a redesigned Start menu, the replacement of its live tiles with a separate Widgets panel on the taskbar, the ability to create tiled sets of windows that can be minimized and restored from the taskbar as a group, and new gaming technologies inherited from Xbox Series X and Series S such as Auto HDR and DirectStorage on compatible hardware. Internet Explorer (IE) has been replaced by the Chromium-based Microsoft Edge as the default web browser like its predecessor, Windows 10, and Microsoft Teams is integrated into the Windows shell. Microsoft also announced plans to allow more flexibility in software that can be distributed via Microsoft Store, and to support Android apps on Windows 11 (including a partnership with Amazon to make its app store available for the function). Citing security considerations, the system requirements for Windows 11 were increased over Windows 10. Microsoft only officially supports the operating system on devices using an eighth-generation Intel Core CPU or newer (with some minor exceptions), AMD Ryzen CPU based on Zen+ microarchitecture or newer, or a Qualcomm Snapdragon 850 ARM system-on-chip or newer, with UEFI secure boot and Trusted Platform Module (TPM) 2.0 supported and enabled (although Microsoft may provide exceptions to the TPM 2.0 requirement for OEMs). While the OS can be installed on unsupported processors, Microsoft does not guarantee the availability of updates. Windows 11 removed support for 32-bit x86 CPUs and devices which use BIOS firmware. Windows 11 has received a mixed reception. Pre-release coverage of the operating system focused on its stricter hardware requirements, with discussions over whether they were legitimately intended to improve the security of Windows or as a ploy to upsell users to newer devices, and over e-waste associated with the changes. Upon release, it was praised for its improved visual design, window management, and a stronger focus on security, but was criticized for various modifications to aspects of its user interface which were seen as worse than its predecessor. As of May 2022, Windows 11 is the 2nd most popular Windows edition on Windows PCs in the United States, at 11%, and some other countries (also 2nd in North America as a whole and Oceania/Australia), while globally it remains 3rd on average (and in some countries 4th) after Windows 7, far behind Windows 10, which stands at 77% in the United States.[13] Across all platforms Windows 11 runs on a share of 2.6% of PCs.Development At the 2015 Ignite conference, Microsoft employee Jerry Nixon stated that Windows 10 would be the last version of Windows, a statement that Microsoft confirmed was reflective of its view.[14][15] The operating system was considered to be a service, with new builds and updates to be released over time.[16] In October 2019, Microsoft announced Windows 10X, a future edition of Windows 10 designed exclusively for dual-touchscreen devices such as the then-upcoming Surface Neo. It featured a modified user interface designed around context-sensitive postures for different screen configurations and usage scenarios, and changes such as a centered taskbar and updated Start menu without Windows 10's live tile. Legacy Windows applications would also be required to run in  to ensure performance and power optimization. Microsoft stated that it planned to release Windows 10X devices by the end of 2020.[17][18][19] In May 2020, amid the COVID-19 pandemic, chief product officer for Microsoft Windows and Office Panos Panay stated that as we continue to put customers' needs at the forefront, we need to focus on meeting customers where they are now, and therefore announced that Windows 10X would only launch on single-screen devices at first, and that Microsoft would continue to look for the right moment, in conjunction with our OEM partners, to bring dual-screen devices to market.[20][21] In January 2021, it was reported that a job listing referring to a sweeping visual rejuvenation of Windows had been posted by Microsoft.[22] A visual refresh for Windows, developed under the codename , was reportedly set to re-design the system's user interface.[23] It was rumored to be released as a Windows 10 feature update as version 21H2.[24] However, this would later be spun off into Windows 11. Microsoft began to implement and announce some of these visual changes and other new features on Windows 10 Insider Preview builds, such as new system icons (which also included the replacement of shell resources dating back as far as Windows 95),[25] improvements to Task View to allow changing the wallpaper on each virtual desktop, emulation of x64 applications on ARM, and adding the Auto HDR feature from Xbox Series X.[26][27] On May 18, 2021, Head of Windows Servicing and Delivery John Cable stated that Windows 10X had been canceled and that Microsoft would be.[28] Announcement At the Microsoft Build 2021 developer conference, CEO and chairman Satya Nadella teased about the existence of the next generation of Windows during his keynote speech. According to Nadella, he had been self-hosting it for several months. He also teased that an official announcement would come very soon.[29] Just a week after Nadella's keynote, Microsoft started sending invitations for a dedicated Windows media event at 11 am ET on June 24, 2021.[30][31] Microsoft also posted an 11-minute video of Windows start-up sounds to YouTube on June 10, 2021, with many people speculating both the time of the Microsoft event and the duration of the Windows start-up sound video to be a reference to the name of the operating system as Windows 11.[32][33] On June 24, 2021, Windows 11 was officially announced at a virtual event hosted by Chief Product Officer Panos Panay.[34][35][36] According to Nadella, Windo), new Fluent Design guidelines, and more were discussed during another developer-focused event on the same day.[38][39][40] Release The Windows 11 name was accidentally released in an official Microsoft support document in June 2021.[41][42] Leaked images of a purported beta build of Windows 11's desktop surfaced online later on June 15, 2021,[43][44] which were followed by a leak of the aforementioned build on the same day.[45] The screenshots and leaked build show an interface resembling that of the canceled Windows 10X, alongside a redesigned out-of-box experience (OOBE) and Windows 11 branding.[46] Microsoft would later confirm the authenticity of the leaked beta, with Panay stating that it was an.[47][48] At the June 24 media event, Microsoft also announced that Windows 11 would be released in .[49][50] Its release will be accompanied by a free upgrade for compatible Windows 10 devices through Windows Update.[51] On June 28, Microsoft announced the release of the first preview build and SDK of Windows 11 to Windows Insiders.[52] On August 31, 2021, Microsoft announced that Windows 11 was to be released on October 5, 2021.[53] The release would be phased, with newer eligible devices to be offered the upgrade first.[6] Since its predecessor Windows 10 was released on July 29, 2015, more than six years earlier, this is the longest time span between successive releases of Microsoft Windows operating systems, beating the time between Windows XP (released on October 25, 2001) and Windows Vista (released on January 30, 2007).[54] Microsoft officially released Windows 11 on October 4, 2021, at 2:00 p.m. PT, which was October 5 in parts of the world.[55] It can be obtained as an in-place upgrade via either the Windows 11 Installation Assistant application (the successor to the Media Creation Tool from Windows 10, which can also generate an ISO image or USB install media), or via Windows Update on eligible devices.[56] On May 9, 2022, Microsoft released Windows 11 on physical media in the form of a boxed USB drive and product key. These boxed copies were made available on Amazon and Best Buy's online storefronts.[57][58] Upgrades through Windows Update are a phased rollout, and are distributed on an opt-in basis: Microsoft stated that they [59][60] Eligible devices also may present an option to download Windows 11 during the Windows 10 out-of-box experience (OOBE) on a new installation.[61] In launch they partnered up with Mikey Likes It Ice Cream in NYC to make a flavor named  based on the default  wallpaper to promote Windows 11. The ice cream is blueberry with blueberry pie filling, pound cake & candy chocolate pieces.[62][63] The Burj Khalifa was also lighted up to promote the operating system.[64][65] The ice cream could be compared to Windows 7's launch using a partnership with Burger King to create a 7-patty whopper and Windows 10's launch with a limited  for an ice cream parlor called Daily Chico that originally did 8-scoop ice cream. Features Main article: Features new to Windows 11 See also: List of features removed in Windows 11 Windows 11, the first major Windows release since 2015, builds upon its predecessor by revamping the user interface to follow Microsoft's new Fluent Design guidelines. The redesign, which focuses on ease of use and flexibility,[51] comes alongside new productivity and social features and updates to security and accessibility, addressing some of the deficiencies of Windows 10.[66] The Microsoft Store, which serves as a unified storefront for apps and other content, is also redesigned in Windows 11. Microsoft now allows developers to distribute Win32, progressive web applications, and other packaging technologies in the Microsoft Store, alongside Universal Windows Platform apps.[67] Microsoft also announced plans to allow third-party application stores (such as Epic Games Store) to distribute their clients on Microsoft Store.[68] Windows 11 supports x86-64 software emulation on ARM-based platforms.[69] The collaboration platform Microsoft Teams is integrated into the Windows 11 user interface, and is accessible via the taskbar. Skype will no longer be bundled with the OS by default.[70][71][72] Microsoft claims performance improvements such as smaller update sizes, faster web browsing in ny browser, faster wake time from sleep mode, and faster Windows Hello authentication.[70][73] Windows 11 ships with the Chromium-based Microsoft Edge web browser (for compatibility[74][75] with Google Chrome web browser[76]), and does not include or support Internet Explorer.[77] Its rendering engine MSHTML (Trident) is still included with the operating system for backwards compatibility reasons, and Edge can be configured with Group Policy to render whitelisted websites in IE Mode (which still uses IE's rendering engine MSHTML, instead of Blink layout engine).[78] Windows 11 is the first version of Windows since the original retail release of Windows 95 to not ship with Internet Explorer.[79] The updated Xbox app,[80][81] along with the Auto HDR and DirectStorage technologies introduced by the Xbox Series X and Series S, will be integrated into Windows 11; the latter requiring a graphics card supporting DirectX 12 and an NVMe solid-state drive.[81][82] User interface A redesigned user interface is present frequently throughout the operating system, building upon Fluent Design System; translucency, shadows, a new color palette, and rounded geometry are prevalent throughout the UI. A prevalent aspect of the design is an appearance known as Mica, described as an .[83][84] Much of the interface and start menu takes heavy inspiration from the now-canceled Windows 10X.[85] The Segoe UI font used since Windows Vista has been updated to a variable version, improving its ability to scale between different display resolutions.[86] The taskbar's buttons are center-aligned by default, and it is permanently pinned to the bottom edge of the screen; it cannot be moved to the top, left, or right edges of the screen as in previous versions of Windows without manual changes to the registry.[87] The notifications sidebar is now accessed by clicking the date and time, with other Quick Actions toggles, as well as volume, brightness, and media playback controls, moved to a new settings pop-up displayed by clicking on the system tray. The Widgets button on the taskbar displays a panel with Microsoft Start,[88] a news aggregator with personalized stories and content (expanding upon the news and interests panel introduced in later builds of Windows 10).[73][83] Microsoft Teams is similarly integrated with the taskbar, with a pop-up showing a list of recent conversations.[72] The Start menu has been significantly redesigned, replacing the  used by Windows 8.x and 10 with a grid of applications, and a list of recent applications and documents.[70][73] File Explorer was updated to replace its ribbon toolbar with a more traditional toolbar, while its context menus have been redesigned to move some tasks (such as copy and paste) to a toolbar along the top of the menu, and hide other operations under an overflow menu.[83] Task View, a feature introduced in Windows 10, features a refreshed design, and supports giving separate wallpapers to each virtual desktop. The window snapping functionality has been enhanced with two additional features; hovering over a window's maximize button displays pre-determined  for tiling multiple windows onto a display, and tiled arrangement of windows can be minimized and restored from the taskbar as a .[73][89] When a display is disconnected in a multi-monitor configuration, the windows that were previously on that display will be minimized rather than automatically moved to the main display. If the same display is reconnected, the windows are restored to their prior location.[90] Windows Subsystem for Android Further information: Project Astoria and Windows Subsystem for Linux On October 21, 2021, Windows Subsystem for Android (WSA) became available to Beta channel builds of Windows 11 for users in the United States,[91] which allows users to install and run Android apps on their devices. Users can install Android apps through any source using the APK file format.[92] An Amazon Appstore client for Microsoft Store will also be available.[93][94][95][96] WSA is based on the Intel Bridge runtime compiler; Intel stated that the technology is not dependent on its CPUs, and will also be supported on x86-64 and ARM CPUs from other vendors.[96] System security As part of the minimum system requirements, Windows 11 only runs on devices with a Trusted Platform Module 2.0 security coprocessor.[97][98] According to Microsoft, the TPM 2.0 coprocessor is a  for protection against firmware and hardware attacks. In addition, Microsoft now requires devices with Windows 11 to include virtualization-based security (VBS), hypervisor-protected code integrity (HVCI), and Secure Boot built-in and enabled by default.[99] The operating system also features hardware-enforced stack protection for supported Intel and AMD processors for protection against zero-day exploits. Like its predecessor, Windows 11 also supports multi-factor authentication and biometric authentication through Windows Hello.[99] Versions Main article: Windows 11 version history Windows 11 is available in two main editions; the Home edition, which is intended for consumer users, and the Pro edition, which contains additional networking and security features (such as BitLocker), as well as the ability to join a domain.[100] Windows 11 Home may be restricted by default to verified software obtained from Microsoft Store ().[101] Windows 11 Home requires an internet connection and a Microsoft account in order to complete first-time setup.[102] In February 2022, it was announced that this restriction will also apply to Windows 11 Pro in the future.[103] Windows 11 SE was announced on November 9, 2021, as an edition exclusively for low-end devices sold in the education market, and a successor to Windows 10 S. It is designed to be managed via Microsoft Intune, and has changed based on feedback from educators to simplify the user interface and reduce , such as Snap Layouts not containing layouts for more than two applications at once, all applications opening maximized by default, Widgets being completely removed, and Microsoft Edge is configured by default to allow extensions from the Chrome Web Store (primarily to target those migrating from Chrome OS). It is bundled with applications such as Microsoft Office for Microsoft 365, Minecraft Education Edition, and Flipgrid, while OneDrive is used to save files by default. Windows 11 SE does not include Microsoft Store; third-party software is provisioned or installed by administrators.[104][105] The Windows Insider program carries over from Windows 10, with pre-release builds divided into .  Before you begin Make sure the device you want to install Windows 11 on meets the minimum system requirements. If your device is currently running Windows 10, we recommend you verify the minimum system requirements using the PC Health Check app. We do not recommend installing Windows 11 on a device that doesn't meet requirements. For more info, see Installing Windows 11 on devices that don't meet minimum system requirements. Windows Update in Settings (recommended) If you`re upgrading from Windows 10, we recommend you wait until you're notified through Windows Update that the upgrade is ready for your device. To check if Windows 11 is ready for your device, select Start  > Settings  > Update & Security  > Windows Update  > Check for updates. For known issues that might affect your device, you can also check the Windows release health hub.",
  "author":"Shaikh Abdul Mannan",
  "slug":"how-to-install-win-11"
}
